{
  "Pancit Sports": {
    "website": "https://www.pancit.co/collections/all",
    "phone": "+65 8749 7699",
    "email": "weekendwarrior@pancit.co",
    "description": "Pancit Sports is a Singaporean niche sports store and they sell all kinds of sports equipment, for sports like disc golf, ultimate frisbee, golf, boxing, and of course, skating. They are an official Micro distributor, and hence mostly stock Micro skates. This means that they only stock fitness and urban skates, as well as kids skates. They also stock Rollerblade and Cougar skates, but the ones they stock are for kids. They do have a <a href=\"https://shopee.sg/pancitsports#product_list\">Shopee</a> and a <a href=\"https://www.lazada.sg/pancit-sports/?q=All-Products&from=wangpu&langFlag=en&pageTypeId=2\">Lazada</a> online store if you would like to use those platforms to buy skates. They also have a <a href=\"https://www.facebook.com/pancitsports/posts/pfbid029vYK77r8NGprKJDwLqu7rjviRZqrteoEdCHvmXJNqLKvFk4gJ7U3JvKtkbCfRLd1l?__cft__[0]=AZUs1WaFGlgmtQQF4von4XxnI1J2nFxzEER9tL_g8-sV5V9N2bA0yyNQrhSF08ySBwfk5WSrsAwRCEyfM5OtLip6uU02mRt0UtlsAGRkTY-dliH-l18m-BWXaDbNO46WJpkaAHFJ_25vTCkYhaBRnlPusJ42kIVUOp4DaAyGuR7Au0xsOIoMtMmR--saY7pCDY9fkzFuyk562uG87fVY2OuN&__tn__=%2CO%2CP-R\">10% discount</a> for people who are learning inline skating. In general, unless you absolutely must have a Micro skate or have that 10% discount, it's much better to visit a physical skate shop in Singapore instead of buying from here."
  },
  
  "Inline Warehouse": {
    "website": "https://www.inlinewarehouse.com/",
    "address": "181 Suburban Rd, San Luis Obispo, CA 93401, United States",
    "hours": "Open from 10am - 5:30pm (PST) from Monday to Saturday for self pick up, closed on Sundays. Their phone line is operational from 8:00am - 6:00pm (EST) on weekdays.",
    "phone": "+1 800-366-3070",
    "email": "info@inlinewarehouse.com",
    "mapLink": "https://goo.gl/maps/bMjZoFgBXgNeUJgF6",
    "description": "Inline Warehouse is just that, a warehouse that stocks inline skates. They also have other warehouses for <a href=\"\">ice skating</a> and for <a href=\"\">roller skates</a>, so they stock fitness, urban, speed, aggressive, roller skates and ice skates. They also sell Endless frames that can be used for wizard skating, but they don't sell a whole wizard skate."
  },
  
  "Japy Skates": {
    "website": "https://japyskates.aliexpress.com/store/822552",
    "phone": "+86 139-1826-6317",
    "description": "Japy Skates is a Chinese Aliexpress store. While them being an Aliexpress store doesn't inspire confidence in the authenticity of their products, their products are legitimate and the prices line up with other skate shops, so there is no need to worry. They sell fitness, urban, speed and aggressive (called extreme on their store) skates. They also sell roller skates and ice skates, but the selection is pretty limited."
  },
  
  "Gogoskate": {
    "website": "https://www.gogoskate.com/",
    "hours": "Open from 9am - 7pm (CST) from Monday to Saturday",
    "email": "service@gogoskate.com",
    "description": "Gogoskate is an online shop in the US that sells fitness, urban, speed and roller skates. They mostly stock Flying Eagle skates, with a few Freestyle skates, so the selection isn't great. If you're in Singapore, you should just buy from the Flying Eagle official store instead. You can also find Freestyle skates at most of the Singaporean skate shops. For some reason, their roller skates are unbranded as well, with no brand in the product name, but there are some that have their brand mentioned in the product description. The shop just seems a little sketchy. They did, however, send a Flying Eagle F4 Raven to <a href=\"https://youtu.be/IbaDv0CKe-4\">a skater on YouTube</a>, so maybe they aren't as sketchy as they seem, but that's up to you to decide."
  }
}