{
  "Hvper Sport Downtown East / HiRoller": {
    "address": "1 Pasir Ris Cl, Level 5 E!Hub @ Downtown East #05-104, Singapore 519599",
    "hours": "Open from 12pm - 7pm (SGT) on weekdays, and from 12pm - 8pm (SGT) on weekends and public holidays",
    "phone": "+65 9694 4094",
    "email": "info@hvpersport.com",
    "website": "https://hvpersport.com/product-category/all/",
    "mapLink": "https://g.page/HiRoller?share",
    "description": "At Hvper Sport, you can use the student discount and save about 30% - 35% on some skates. The selection here, however, is quite limited and there really isn't much to choose from. Most of the skates sold here are Seba and the other brands like NEXUS (Hvper Sport's proprietary brand) and Freestyle don't have many reviews. Despite this, they are the sole retailer of Takino skates in Singapore, but it is also not a brand that gets a lot of mentions in the inline skating community either as Takino specialises in speed skates. Hvper Sport also doesn't carry aggressive skates or figure-inline skates."
  },

  "Ernsports @ ECP": {
    "address": "920 East Coast Parkway, #01-14/15/16 Parkland Green, Singapore 449875",
    "hours": "Open from 12pm - 8pm (SGT) on weekdays, and from 11am - 8pm (SGT) on weekends",
    "phone": "+65 9724 6638",
    "email": "ask@ernsports.com",
    "website": "https://www.ernsports.com/shop/",
    "mapLink": "https://goo.gl/maps/YTvJZYCXCadcRNti8",
    "description": "Similar to Hvper Sports, you can use the student discount here and save about 30% - 35% on some skates. Ernsports also has a very limited selection of skates and only sells Seba and Freestyle skates, which is an even more limited selection than Hvper Sports. They only sell urban and recreational skates here and do not stock other kinds of skates, like aggressive skates, speed skates or roller skates. Needless to say, they don't stock figure-inline skates either. Interestingly, they have a <a target=\"_blank\" href=\"https://www.lazada.sg/ernsports/?q=All-Products&from=wangpu&langFlag=en&pageTypeId=2\">Lazada online shop</a> in addition to their online shop."
  },
  
  "Ernsports @ Punggol Promenade Riverside Walk": {
    "address": "6 Tebing Lane, #01-02A, Singapore 828835",
    "hours": "Open from 12pm - 8pm (SGT) on weekdays, and from 11am - 8pm (SGT) on weekends",
    "phone": "+65 9724 6638",
    "email": "ask@ernsports.com",
    "website": "https://www.ernsports.com/shop/",
    "mapLink": "https://goo.gl/maps/B5QQcMyD96Aa26Cb9",
    "description": "Similar to Hvper Sports, you can use the student discount here and save about 30% - 35% on some skates. Ernsports also has a very limited selection of skates and only sells Seba and Freestyle skates, which is an even more limited selection than Hvper Sports. They only sell urban and recreational skates here and do not stock other kinds of skates, like aggressive skates, speed skates or roller skates. Needless to say, they don't stock figure-inline skates either. Interestingly, they have a <a target=\"_blank\" href=\"https://www.lazada.sg/ernsports/?q=All-Products&from=wangpu&langFlag=en&pageTypeId=2\">Lazada online shop</a> in addition to their online shop."
  },

  "Inlinex": {
    "address": "37 Kallang Pudding Road, #09-06 Building B, Singapore 349315",
    "hours": "Open from 12pm - 8pm (SGT) on weekdays, and from 11am - 7pm (SGT) on weekends. Closed on public holidays.",
    "phone": "+65 8123 3425 (sales support) & +65 9464 2702 (after sales and technical support)",
    "email": "admin@inlinex.com.sg",
    "website": "https://www.inlinex.com.sg/collections/all",
    "mapLink": "https://g.page/Inlinex?share",
    "description": "Inlinex probably has the largest selection of skates out of any inline skate shop in Singapore. They stock all kinds of skates, except for figure-inline skates. It seems like Inlinex is the only place in Singapore to get aggressive skates as well. Furthermore, you can use the student discount here, which is 15% off all non-discounted items. It isn't as high as the other shops that offer a student discount, but it applies to most, if not all of their skates, rather than having to stick to a catalogue. You should definitely buy your skates from here due to the incredible selection. Do note that they only accept NETS, cash and PayNow."
  },

  "OneUpSkates": {
    "address": "3 Ang Mo Kio Street 62, #02-13, Singapore 569139",
    "hours": "Open from 12pm - 8pm (SGT) on weekdays, and from 10am - 8pm (SGT) on weekends",
    "phone": "+65 9456 8346",
    "email": "bryant@oneupskates.com",
    "website": "https://oneupskates.com/collections/all?filter.v.availability=1",
    "mapLink": "https://g.page/oneupskates?share",
    "description": "OneUpSkates has a decent selection of skates to choose from but it is still nowhere near Inlinex's selection. They stock brands like Flying Eagle, K2, Micro, Powerslide and Rollerblade, which are all pretty reputable brands. They also stock roller skates as well. However, they don't stock any aggressive skates or figure-inline skates and quite a huge portion of their currently available skates are recreational skates from K2 and Rollerblade. You also cannot use the student discount here and their location in Ang Mo Kio is also not as accessible as Inlinex for most people. It is a good place to get skates if you live around the area, but for people who live elsewhere, you should go to Inlinex for its vastly superior selection and more accessible location."
  },

  "Freeskate Inline": {
    "address": "338 Ang Mo Kio Ave 1, #01-1649, Singapore 560338",
    "hours": "Open from 12pm - 8:30pm (SGT) daily, closed on Mondays",
    "phone": "+65 9128 9589",
    "email": "Rachelyrx@gmail.com",
    "website": "https://www.freeskateinline.com/shop?page=2",
    "mapLink": "https://goo.gl/maps/qhmyiR8D9szsartp8",
    "description": "Similar to OneUpSkates, Freeskate Inline is also located in Ang Mo Kio which may not be the most accessible location for most people. They have 2 websites, one ending in '.com.sg' and one ending with '.com'. The one ending in '.com.sg' is about 10 years old and hasn't been updated since, so go to the one ending in '.com' for the updated one. The selection of skates here is probably the smallest among all of the stores, with them pretty much only stocking recreational skates from Rollerblade and K2. You also cannot use the student discount here. I'll recommend going to OneUpSkates to buy skates instead of here, but it's a good place to get your skates repaired, have lessons or rent a skate."
  },
  
  "Flying Eagle Skate Singapore": {
    "address": "33 Ubi Avenue 3 #08-25 Vertex Tower B, Singapore 408868",
    "hours": "Open from 11am - 6pm (SGT) daily, closed on Sundays and Wednesdays. On Saturdays however, it is open from 11am - 3pm (SGT).",
    "phone": "+65 9060 8524",
    "email": "aloysius.nguan@gmail.com",
    "website": "https://www.facebook.com/FESkateSG/",
    "mapLink": "https://goo.gl/maps/NVyTSYSu2zdPqcyb9",
    "description": "You will need an appointment to even enter the shop. To book an appointment, you'll want to message them on either <a target=\"_blank\" href=\"https://www.facebook.com/FESkateSG/\">Facebook</a> or <a target=\"_blank\" href=\"https://www.instagram.com/flyingeagleskate.singapore/?hl=en\">Instagram</a>. However, you can browse their shop on <a target=\"_blank\" href=\"https://shopee.sg/feskatesg#product_list\">Shopee</a>, <a target=\"_blank\" href=\"https://www.lazada.sg/shop/flying-eagle-skate-singapore\">Lazada</a> or <a target=\"_blank\" href=\"https://www.carousell.sg/u/cars_and_skates/\">Carousell</a> and buy your skates directly from there if you know what you want and you are sure that the skates will fit. Expectedly, you can only get Flying Eagle skates from here, so the variety of skates is quite limited. Also, you cannot use the student discount here. They only sell recreational and urban skates and do not carry aggressive skates and figure-inline skates. They also sell accessories like bags and protective gear at a lower price than even Decathlon so it's worth checking out their online store if you are looking for accessories. Once again, you should go to Inlinex to buy your skates since its selection is much more diverse than the other stores."
  },
  
  "SkateXtreme": {
    "address": "10 Ubi Crescent #05-75 Ubi TechPark Lobby D, Singapore 408564",
    "hours": "Open on weekends from 10:30am - 12:00pm (SGT), and from 2:00pm - 6:30pm (SGT). Closed on weekdays.",
    "phone": "+65 9452 3955",
    "email": "info@skatextremesg.com",
    "website": "https://www.skatextremesg.com/inline-skate-shop",
    "mapLink": "https://www.google.com/maps/place/Skatextreme+-+Inline+Skate+Shop+(By+Appointment+Only)/@1.3264632,103.6162136,11z/data=!3m1!5s0x31da19d651828e4d:0xab0a75dc5e7f4750!4m7!3m6!1s0x31da17e0e140b94d:0x4b8338ddc44c84f1!8m2!3d1.3264632!4d103.896365!15sCiZTaG9wIFRhc2sgU2thdGVzIC0gUm9sbGVyYmxhZGluZyBTdG9yZSIDiAEBWiYiJHNob3AgdGFzayBza2F0ZXMgcm9sbGVyYmxhZGluZyBzdG9yZZIBCnNrYXRlX3Nob3DgAQA!16s%2Fg%2F11p56b_553?coh=164777&entry=tt",
    "description": "SkateXtreme is a store that mostly focuses on teaching inline skating, so you can contact them for skating lessons if you want to. They mostly stock Micro products as they are an official Micro distributor, which means they only have fitness and urban skates. As expected for a store that focuses on teaching inline skating, a lot of their skates are catered to kids, with only a few options for adult skaters. They also do offer in-store shopping, but you'll have to book an appointment with them via email or phone. Overall, if you want an urban Micro skate, then you could consider buying from here. Otherwise, you should be going elsewhere to get your skates."
  }
}