{
  "explanation": "The routes are ranked based on their difficulty level. A beginner-level urban route does not require T-stops, and the routes are relatively smooth with very few short slopes. Ferrying is not needed either. A beginner to intermediate level urban route requires some ability to T-stop, but does not require full competency. A partial T-stop that is engaged and then re-engaged is sufficient for a beginner to intermediate-level urban driving. Ferrying will likely be required for those who cannot T-stop at all. Beginner to intermediate level urban routes have around 1 to 3 slopes that are relatively short and gentle and are manageable with partial T-stopping. Intermediate-level urban routes require decent competency at T-stop, with the minimum being able to hold the T-stop without spinning out or changing direction on flat ground. These urban routes usually have more slopes and longer slopes, and are longer than the beginner to intermediate level urban routes, but still have terrain that is relatively easy to navigate and isn't too bumpy or hazardous. Intermediate to advanced urban routes are where most of the urban routes are ranked, as these routes require a high level of competency for T-stop, which is being able to hold the T-stop down slopes. The routes in this difficulty range are usually longer than 10 km and feature steeper slopes and rougher terrain. These routes will pose significant difficulty for beginners, and they will struggle greatly if they follow these urban routes, even when there are people to ferry them. Advanced-level urban routes are routes that require maximal competency in T-stop, as they feature very long slopes which allow you to go at high speeds. These urban routes are usually longer than 20 km, so skaters who attend these urban routes need to have good endurance and be able to skate efficiently for long distances. Skaters who participate in these routes should also be able to T-stop on both feet so they can endure the longer distances. Advanced to master level urban routes are mostly just longer variants of advanced-level routes, usually ranging from 30 km to 40 km, so even more endurance is required. The final level of urban routes, the master level, is reserved for extremely long urban routes that are above 50 km in length, or feature extremely steep slopes that require almost full body weight on the back leg of the T-stop to slow down effectively. Skaters who participate in master-level urban routes should ideally have an alternative stopping technique to T-stop, such as a front powerslide or even the parallel or magic slide to stop quickly in case of an emergency. The pace for master-level urban routes is zippy, and most would utilise tri-skates or even speed skates to cover distances quicker due to how long the routes are.",
  "difficulty": {
    "beginner": [
      {
        "name": "Ernsports to Bedok Jetty to Ernsports",
        "distance": "9.9 km",
        "link": "https://maps.app.goo.gl/3mbhqrQfptEVeZkx5",
        "description": ""
      }
    ],
    "beginner-to-intermediate": [
      {
        "name": "Ernsports to Stadium MRT",
        "distance": "6.9 km",
        "link": "https://maps.app.goo.gl/hv6icLtXdiSa1XgPA",
        "description": ""
      },
      {
        "name": "West Coast Park to VivoCity",
        "distance": "9 km",
        "link": "https://maps.app.goo.gl/m6XQDhnZmTAqesyE7",
        "description": ""
      }
    ],
    "intermediate": [],
    "intermediate-to-advanced": [
      {
        "name": "Buangkok MRT to Waterway Point",
        "distance": "7.8 km",
        "link": "https://maps.app.goo.gl/d7MDpE84oBgRyia28",
        "description": "This route only gets its difficulty rating due to the beginning section, which is not beginner friendly. Beginners who want to skate this route should instead start <a href='https://maps.app.goo.gl/aXc5wyPNJYcoTScQ8'>here</a>."
      },
      {
        "name": "Buangkok MRT to Waterway Point to Pasir Ris MRT",
        "distance": "17 km",
        "link": "https://maps.app.goo.gl/MGNVpBM5ypnwbW96A",
        "description": ""
      },
      {
        "name": "Buangkok MRT to Pasir Ris MRT",
        "distance": "19 km",
        "link": "https://maps.app.goo.gl/TDJn798ND1ewuP35A",
        "description": ""
      },
      {
        "name": "Buona Vista MRT to Esplanade MRT",
        "distance": "9.6 km",
        "link": "https://maps.app.goo.gl/4hX1FAHL3rHpzQQu8",
        "description": ""
      },
      {
        "name": "North Eastern Riverine Loop",
        "distance": "18 km",
        "link": "https://maps.app.goo.gl/9GaEfVChPhj6nF15A",
        "description": ""
      },
      {
        "name": "Marymount to Jurong East",
        "distance": "22 km",
        "link": "https://maps.app.goo.gl/LucSY7kCKwxPWVor9",
        "description": ""
      }
    ],
    "advanced": [],
    "advanced-to-master": [],
    "master": []
  }
}
