{
  "Heel brake": {
    "description": "To use the heel brake, get into the scissors position and make sure that you have more of your weight on your back foot. Your weight should be 40% on the front foot and 60% on the back foot. Next, lift your heel on the front skate and let the heel brake slide across the ground. You should feel yourself slowing down. If you would like to stop faster, gradually shift more of your weight to the front skate so that there would more friction between the heel brake and the ground.",
    "videos": [
      ["SkaMiDan", "https://youtu.be/Y-RQJMczJ4s?t=17"],
      ["Skatefresh Asha", "https://youtu.be/AM4ptyerMro?t=240"],
      ["Skatefresh Asha", "https://youtu.be/gn3EjcBvgSQ"],
      ["Ricardo Lino", "https://youtu.be/HIl62hZKAok"],
      ["Damian Nawa", "https://youtu.be/VuhzgF7MLWY"],
      ["Flow Skate", "https://youtu.be/8xwOkoQuhwU?t=198"],
      ["SkaMiDan", "https://youtu.be/eEhc6cXQE6E?t=82"],
      ["Ricardo Lino", "https://youtu.be/E_hOIWuO8qA?t=373"],
      ["How To Inline Skate", "https://youtu.be/MZsqtjON0RI"],
      ["InMove Skates", "https://youtu.be/C_fg6xwWY-s?t=146"],
      ["Tiago", "https://youtu.be/dE2Xp78OxEA?t=54"],
      ["SkaMiDan", "https://youtu.be/eEhc6cXQE6E?t=82"],
      ["Skatefresh Asha", "https://youtu.be/z3LyQ-e6Dh4?t=44"],
      ["Rollerblade", "https://youtu.be/Lkz3u6OZh8c"],
      ["Rollerblade", "https://youtu.be/Sj_qcL6xxpI"],
      ["Sikana", "https://youtu.be/Ta_DBRMiPgE"],
      ["Howcast", "https://youtu.be/UDcJtf_D2gY?t=5"],
      ["Howcast", "https://youtu.be/p2_QuTdYdE4?t=16"],
      ["Marcel's Hockey School", "https://youtu.be/DOkzoVgEUH0?t=53"],
      ["Powerslide Inline Skates", "https://youtu.be/tV6yE40XrY4"]
    ]
  },

  "Plough stop": {
    "description": "To do the plough stop, get into the A-frame position where your feet are wide apart and your skates are on the inside edge. Then, turn your skates inwards and use your tighs to push against the ground to keep your skates from moving inwards. This will cause you to slow down. If you find your skates getting too close to each other or are colliding, instead of allowing them to collide, just spread them wide apart and do the plough stop again. You can repeat the plough stop as many times as necessary to stop.",
    "videos": [
      ["Skatefresh Asha", "https://youtu.be/uKTDQ_bJRAc?t=178"],
      ["This Is Soul", "https://youtu.be/ar5cdY31Y-w?t=45"],
      ["SkaMiDan", "https://youtu.be/c6iiniZwD_8?t=43"],
      ["SkaMiDan", "https://youtu.be/eEhc6cXQE6E?t=207"],
      ["Ricardo Lino", "https://youtu.be/E_hOIWuO8qA?t=46"],
      ["Ricardo Lino", "https://youtu.be/EnhrFrD_Fas?t=559"],
      ["Ricardo Lino", "https://youtu.be/m_Sfr4u5F5s?t=379"],
      ["Ricardo Lino", "https://youtu.be/44q6dnrKQ_k?t=160"],
      ["Damian Nawa", "https://youtu.be/boWHf4KST9A"],
      ["Flow Skates", "https://youtu.be/8xwOkoQuhwU?t=352"],
      ["InMove Skates", "https://youtu.be/C_fg6xwWY-s?t=11"],
      ["How To Inline Skate", "https://youtu.be/YluMjh8Fjzk"],
      ["Deez Skates", "https://youtu.be/2WzQjJNUnvw?t=840"],
      ["Pascal Briand", "https://youtu.be/67_4SADw_aU?t=19"],
      ["Howcast", "https://youtu.be/p2_QuTdYdE4?t=65"]
    ]
  },
  
  "Stepping plough stop": {
    "description": "To do the stepping plough stop, put your weight on one foot and lift the other foot. Turn that foot you lifted inwards and place it as far away from your other foot as you can and let it roll towards the centre. When your foot is about 15cm away from the other foot, turn it straight and glide on that foot, putting your weight on it. Now just repeat the process with the other foot and you should find yourself slowing down. If you want to stop faster, turning your foot inwards more and doing more steps would make the stepping plough stop more effective at stopping.",
    "videos": [
      ["Skatefresh Asha", "https://www.youtube.com/watch?v=thDnaDdrknY"],
      ["Skatefresh Asha", "https://youtu.be/z3LyQ-e6Dh4?t=58"],
      ["Ricardo Lino", "https://youtu.be/E_hOIWuO8qA?t=190"],
      ["Brandon Drummond", "https://youtu.be/0hxM74GG2H4?t=305"],
      ["Pascal Briand", "https://youtu.be/wNz_jtHVkbg?t=171"],
      ["Damian Nawa", "https://youtu.be/boWHf4KST9A?t=368"]
    ]
  },
  
  "Spin stop": {
    "description": "To do the spin stop, you will need to get comfortable with doing a circular motion with both legs. Start by doing a circular motion with one leg at a time. Once you're comfortable, do the circular motion with both legs at the same time. You can use something to support yourself to help with balancing. Afterwards, start trying to do the spin stop at extremely slow speeds, slowly increasing the speed as you get more and more comfortable. Do note that the spin stop is completely unviable at medium to high speeds as the spin is nigh impossible to control at those speeds, so you should use another stopping technique to slow down before executing the spin stop to completely stop yourself.",
    "videos": [
      ["SkaMiDan", "https://youtu.be/e4oERhPh8ng?t=18"],
      ["SkaMiDan", "https://youtu.be/eEhc6cXQE6E?t=272"],
      ["Dunia Inline Skate", "https://youtu.be/snHDnQ05WAY?t=78"],
      ["Coach Moon", "https://youtu.be/9Qr5Rjb75sw"],
      ["Acosta Blades", "https://youtu.be/fFKGg3NCI2s?t=28"]
    ]
  },
  
  "Lunge stop": {
    "description": "The lunge stop is a stop coined by Skatefresh Asha. It is basically an extremely tight parallel turn, with the turn radius being about 1 to 2 metres. You just need to do a very sharp and very tight parallel turn and then shift your weight from your front leg to the back leg at the end of the turn to stop yourself from rotating further.",
    "videos": [
      ["Skatefresh Asha", "https://youtu.be/VOgvDKxAhjo?t=25"]
    ]
  },
  
  "T-stop": {
    "description": "The T-stop is probably the most versatile and low-risk way to slow down in all situations while being relatively easy to learn. The key to mastering the T-stop is to master your balance on one skate. Without mastering your balance on one skate, you'll find that you'll tend to spin out and your feet just cannot keep the position well at all. So make sure you can balance on one skate for at least half a court. Any court will do, be it a tennis court, a basketball court or a handball court, it doesn't matter. Once you have mastered balancing on one skate, you can move on to learning the T-stop properly. Place most of your weight, about 80%, on one foot and form a 'T' or 'L' shape with the other foot. The other foot should be on the inside edge so that it slides instead of sticking to the ground. After you've mastered the T-stop on flat ground, practice your T-stops on slopes as being able to do a T-stop on flat ground doesn't mean you can do it on slopes. You can use a carpark ramp as it is decently long and has quite an angle, which allows you to perfect your T-stop technique when going down slopes. On slopes, you'll definitely want the T-stop to be more powerful, so you should place your dragging foot much closer to your rolling foot and stand up taller to put more weight on the dragging foot. However, do make sure that you keep an inside edge on the dragging foot, otherwise, you'll just get stuck and fall over. Alternatively, you can also lean backwards to put more weight on your dragging foot, but standing taller and more upright is less tiring to do and is more effective, though it is more difficult to control and needs much more practice to get the hang of. You should also master the T-stop on both sides so you can wear out your wheels evenly, have more options in tight spaces and allow your legs to rest when going down a long slope.",
    "videos": [
      ["Ricardo Lino", "https://youtu.be/JhUDmgMa78c"],
      ["Damian Nawa", "https://youtu.be/78OcbB5IzGk"],
      ["Thirty+Rollin", "https://youtu.be/-G-sDehI1kY?t=23"],
      ["Whitty", "https://youtu.be/NWrDAi3aZLs?t=24"],
      ["SkaMiDan", "https://youtu.be/QNKcKjLXoO4?t=20"],
      ["Bill Stoppard", "https://youtu.be/wVz__SIr2rY"],
      ["Bill Stoppard", "https://youtu.be/VJgWAqbnVBc?t=44"],
      ["Deez Skates", "https://youtu.be/2WzQjJNUnvw?t=678"],
      ["Bill Stoppard", "https://youtu.be/zjX8CWIfVQw"],
      ["Bill Stoppard", "https://youtu.be/sdgk1MQBtL0?t=23"],
      ["Bill Stoppard", "https://youtu.be/i-MbA6A7ufU"],
      ["Ricardo Lino", "https://youtu.be/E_hOIWuO8qA?t=266"],
      ["How To Inline Skate", "https://youtu.be/qejlkQbVRAM"],
      ["Nik Zvi", "https://youtu.be/bN9d0YaNJe0?t=199"],
      ["Brandon Drummond", "https://youtu.be/0hxM74GG2H4?t=159"],
      ["The Stuttering Skater", "https://youtu.be/eBzmq3uU7UE?t=248"],
      ["Skatefresh Asha", "https://youtu.be/z3LyQ-e6Dh4?t=93"],
      ["Urban Inline", "https://youtu.be/UORe85LDgOk?t=66"],
      ["InMove Skates", "https://youtu.be/C_fg6xwWY-s?t=49"],
      ["Marcel's Hockey School", "https://youtu.be/DOkzoVgEUH0?t=183"],
      ["Skatefresh Asha", "https://youtu.be/uKTDQ_bJRAc?t=278"],
      ["SkaMiDan", "https://youtu.be/eEhc6cXQE6E?t=146"],
      ["Borko", "https://youtu.be/jCjbCNRKyaE"],
      ["Tiago", "https://youtu.be/dE2Xp78OxEA?t=80"],
      ["Acosta Blades", "https://youtu.be/fFKGg3NCI2s?t=89"],
      ["Howcast", "https://youtu.be/p2_QuTdYdE4?t=42"],
      ["Pascal Briand", "https://youtu.be/wNz_jtHVkbg?t=263"]
    ]
  },
  
  "Backwards Inverted T-stop": {
    "description": "This trick is functionally similar to the T-stop, but is only used when moving backwards. To do this trick, get into the scissors position while moving backwards, putting 80% of your weight on your back leg and 20% of your weight on the front leg. Turn your front foot inwards to be perpendicular to the direction that you're moving in and let the foot slide. Make sure that the supporting foot and the sliding foot form a 'T' or 'L' shape so that you'll slow down. If you know how to do the soul slide, just do the soul slide but move backwards instead of forward while doing it.",
    "videos": [
      ["Flow Skate", "https://youtu.be/iBMqpjZsb9k?t=15"],
      ["Skatefresh Asha", "https://youtu.be/lyE_KMGVSnY"],
      ["Tiago", "https://youtu.be/dE2Xp78OxEA?t=118"]
    ]
  },
  
  "Backward T-step": {
    "description": "This is basically a failed powerslide and hence it is only viable at low speeds. At medium to high speeds, you would want to use the powerslide instead. To get into this position while moving backwards, get into the scissors position, put all your weight on one foot, and lift the other. Then, put the other foot behind your supporting foot, making sure that the foot is perpendicular to the direction you are moving in to stop yourself. The supporting foot and the stopping foot should form an 'L' shape. Afterwards, you should find yourself coming to a stop near where you place your stopping foot.",
    "videos": [
      ["Skatefresh Asha", "https://youtu.be/YrKgkuyc8uk?t=326"],
      ["SkaMiDan", "https://youtu.be/pXj8NZfAhSo?t=391"]
    ]
  },
  
  "Power heel": {
    "description": "The power heel is a stop coined by Flow Skates. It is a pretty advanced technique as it is essentially a modified powerslide. First, you do a regular heel brake. After you have engaged the heel brake, you use the heel brake as a pivot point to turn your other foot until it is perpendicular to the direction you're moving in. Make sure that your other foot is on the inside edge to get the foot to slide. Pushing the foot through the heel will also help with getting it to slide.",
    "videos": [
      ["Flow Skates", "https://youtu.be/8xwOkoQuhwU?t=630"]
    ]
  },
  
  "Power step": {
    "description": "The power step is stop coined by Bill Stoppard, but you'll likely have used it before without even realising it. It is extremely simple to pull off. While rolling, just put one foot perpendicular to the direction that you're rolling in, then follow that up by placing your other foot a metre away, in the same direction as your first foot. You should find yourself stopping pretty quickly. Do note that this method of stopping is only viable for low speeds, as at medium to high speeds you will likely fall to the side as your feet don't move with your body. You should use the power stop instead at medium and high speeds.",
    "videos": [
      ["Damian Nawa", "https://youtu.be/_-VVzwotNxQ"],
      ["Bill Stoppard", "https://youtu.be/QIWYHhtH0H0"]
    ]
  },
  
  "Power stop": {
    "description": "The power stop is probably the most powerful stop of all, outside of using slides as stops. It is a stop that was coined and popularised by Bill Stoppard. What a fitting name! Anyway, the power stop is a strange trick in that it is very poorly defined. A lot of different skaters have very different ideas about what it should be and how it should be performed, which results in pretty big differences between all the tutorials teaching this trick. The creator, Bill Stoppard, doesn't have a very good tutorial on this trick which makes it pretty difficult to learn the power stop in the way he intended, not to mention that his power stop has <a href=\"https://youtu.be/jjQSep2k6pU\">evolved</a> over the years, which makes learning the power stop properly a moving target. Bill Stoppard's version seems to be a modified version of the parallel slide, which makes it viable at any speed. The version of the power stop that Flow Skates teaches and breaks down is an older version of Bill Stoppard's power stop that seems more like a modified front powerslide than a modified parallel slide, which also makes it viable at any speed, but isn't as fast or as powerful. Motor Learning Addiction's power stop also seems to be an older version of Bill Stoppard's power stop. Thirty+Rollin's version of the power stop just seems to be a front powerslide. Skatefresh Asha's and Tiago's version is a modified lunge stop that doesn't turn the full 360° but stops halfway at 180°. This makes Asha's power stop less viable for high speeds as it is difficult to create enough counter-rotation to stop yourself in the middle of a turn at high speeds. Rich Hayter's and Whitty's version of the power stop seems to be quite similar to Asha's and Tiago's version, which is a modified version of the lunge stop, but it doesn't have a counter-rotation to stop them from rotating further. Instead, they rely on creating sufficient friction with their skates to stop themselves from rotating further, which makes it unviable for use at high speeds as you can easily spin out and fall. As such, they use other stopping techniques like the T-stop to slow down before executing the power stop at high speeds. Ricardo Lino's version of the power stop seems to be a modified version of a spin stop. Instead of having your feet in a very wide 'V' position, you put a foot down on the ground, like the needle on a compass, and let the other foot spin, like the pencil of the compass. There is also much more weight on the spinning foot and that foot is also on the inside edge so that it'll stop effectively. His version of the power stop also has an end position where the skates are touching each other in a T shape, which makes it unviable at high speeds as you will trip and fall if you fail to lose all of your speed using the power stop. The spinning motion also causes you to spin out and fall at high speeds, which makes it unusable at high speeds as well. In the end, the power stop simply means a powerful stop that can stop you quickly, so you should make it your own. You should just use whatever stops or slides in combination with some other techniques like carving that would allow you to stop near instantly at any speed. After all, the whole point of the power stop is a powerful stop that stops you immediately at any speed and you can break it out whenever it is necessary.",
    "videos": [
      ["Bill Stoppard", "https://youtu.be/ycp9lXrNPjI"],
      ["Bill Stoppard", "https://youtu.be/ytfehYCnpgY"],
      ["Bill Stoppard", "https://youtu.be/1ShToStVq5Y"],
      ["Bill Stoppard", "https://youtu.be/UxvSowy0-sc"],
      ["Bill Stoppard", "https://youtu.be/E1Xphg1D9YA"],
      ["Bill Stoppard", "https://youtu.be/0S94LC0rJus"],
      ["Flow Skates", "https://youtu.be/tzY7jh42zfs"],
      ["Motor Learning Addiction", "https://youtu.be/U7rwmxbAvkU?t=454"],
      ["Skatefresh Asha", "https://youtu.be/_2WUFYTPIPk"],
      ["Skatefresh Asha", "https://youtu.be/VOgvDKxAhjo?t=110"],
      ["Bill Stoppard (old video)", "https://youtu.be/sdgk1MQBtL0?t=84"],
      ["Rich Hayter", "https://youtu.be/nux7upOtMRs"],
      ["Ricardo Lino", "https://youtu.be/a7aiYnzLw4Y"]
    ]
  }
}