{
  "A-frame turn": {
    "description": "The A-frame turn is the simplest turn in inline skating. You might have already done it yourself without even looking up any tutorials or learning from anything. All you need to do is to open your feet wide and push on the foot that is the opposite to the direction you're turning in, so the right foot when turning left and left foot when turning right. Also, do maintain an inside edge on the foot so that you'd turn faster. However, this turn is extremely slow and you should learn the parallel turn as soon as you can as this turn is terrible at medium to high speeds.",
    "videos": [
      ["Damian Nawa", "https://youtu.be/OAzgcD1k7Rc"],
      ["Rollerblade", "https://youtu.be/BVxktKNAwdY"],
      ["MonkeySee", "https://youtu.be/Mkd7nCq6G2U"],
      ["LIVESTRONG.COM", "https://youtu.be/RMIRnNr-PeQ?t=14"]
    ]
  },

  "Pizza turn": {
    "description": "The pizza turn is very simple as well, you probably have already done it without even learning about it. All you need to do is to turn your foot that corresponds to the direction you're going in, a bit more to that direction, so turn your left foot left a bit more if you want to turn left and turn your right foot right a bit more if you want to turn right. This turn would only work at low speeds as you would likely lose balance and fall if you use this turn at medium to high speeds.",
    "videos": [
      ["Ricardo Lino", "https://youtu.be/EnhrFrD_Fas?t=311"],
      ["Brandon Drummond", "https://youtu.be/j61VJj3we2c?t=159"]
    ]
  },

  "Parallel turn": {
    "description": "The parallel turn is the turn that every single inline skater should learn. It forms the basis for many other tricks, such as slalom and slide tricks. To execute the parallel turn, get into the scissor position first. Next, lean your body in the direction that you are turning. Look at the direction that you’re turning towards and rotate your body in that direction. You should find yourself turning in that direction. To make it easier to lean and rotate your body in the direction you’re turning, try to stretch your arms out in a T pose and imagine you are an aeroplane. Lock your shoulders in place and use your body to lean into the direction that you want to turn in and you should find one of your arms being lowered and the other one being raised. You should practice this turn until you can make very sharp and tight turns at any speed, called carving or lunge turns. You should also master this trick for both directions.",
    "videos": [
      ["Ricardo Lino", "https://youtu.be/HBQ8eHboYME"],
      ["Ricardo Lino", "https://youtu.be/EnhrFrD_Fas?t=365"],
      ["Brandon Drummond", "https://youtu.be/j61VJj3we2c?t=20"],
      ["Damian Nawa", "https://youtu.be/eSkY7cS4sDI"],
      ["Nik Zvi", "https://youtu.be/QC1FfeQq950?t=60"],
      ["Serial Wheeler", "https://youtu.be/8bI11aG6Aeo?t=61"],
      ["SkaMiDan", "https://youtu.be/inb3ypISGBA?t=63"],
      ["LIVESTRONG.COM", "https://youtu.be/RMIRnNr-PeQ?t=60"],
      ["Rollerblade", "https://youtu.be/IeFv1nl26Nw"],
      ["MonkeySee", "https://youtu.be/Tnnj7vmXi1s"],
      ["Pascal Briand", "https://youtu.be/CS58LxyXUJY"],
      ["Motor Learning Addiction", "https://youtu.be/U7rwmxbAvkU?t=41"]
    ]
  },

  "Crossovers": {
    "description": "Before learning crossovers, make sure that you have mastered your parallel turns as they are a prerequisite for crossovers. Like the T-stop, you should master your one-leg balance so that you'll have full control over your crossovers, which means you'll be able to adjust how rapidly you're crossing over as well as make your crossovers look smooth and fluid. Hence, you should be able to balance on one leg for half a court. Any court will do, be it a tennis court, a basketball court or a handball court, it doesn't matter. Once you can balance on one leg, you can start to learn crossovers. Start with static crossovers and get comfortable with your legs in a crossover position. Make sure your knees are bent until you can't see your toes and keep your knees bent throughout the entire process. When you're comfortable doing static crossovers, try doing the crossovers while rolling. This time, make sure to start a parallel turn in the direction you're turning in so that you will lean in the correct direction to perform the crossover. Do the crossovers in slow motion, ensuring that you can lift one leg for about 2 seconds before crossing it over the other leg. This exercise will allow you to have far better control over your crossover speed and make them smoother. Once you're able to do that, do crossovers in a small circle to get used to tight turns and leaning. You should also master the crossover on both sides so you can navigate the urban landscape with ease. Doing crossovers in Figure 8 will force you to get good at both sides and transition between the two sides seamlessly. Once your crossovers are smooth, try sprinting while doing crossovers. To do this, you will have to reduce the crossover distance to increase the frequency of crossovers. Also, you'll have to do a tiny jump on every crossover, so make sure to keep practising until it feels smooth and stable. Make sure you can do it on both sides as well so you can gain speed extremely quickly by doing alternating sprinting crossovers.",
    "videos": [
      ["Skatefresh Asha", "https://youtu.be/j7u6myjsYIY?t=185"],
      ["Skatefresh Asha", "https://youtu.be/CTK_l8a2BcE"],
      ["Skatefresh Asha", "https://youtu.be/cJjqTKLcRbg"],
      ["Ricardo Lino", "https://youtu.be/P8Y4d52Ww8Q"],
      ["Marcel's Hockey School", "https://youtu.be/fL4oIY9X41Q"],
      ["Flow Skate", "https://youtu.be/dwDhi9Oyr10"],
      ["Damian Nawa", "https://youtu.be/T0sIKWwAgYM"],
      ["Solo Lap", "https://youtu.be/V0HDc0MYB1I?t=126"],
      ["Viktor Thorup", "https://youtu.be/V5d6yciztC4"],
      ["Viktor Thorup", "https://youtu.be/2-ULGoMvk24?t=73"],
      ["Viktor Thorup", "https://youtu.be/LOOlXHznlDs"],
      ["Pascal Briand", "https://youtu.be/-yx3evZxkFY?t=50"],
      ["Francisco Ramirez", "https://youtu.be/T1S10YTKRdQ"],
      ["Brandon Drummond", "https://youtu.be/VxU-qwqJk58?t=33"],
      ["How To Inline Skate", "https://youtu.be/N2IHbTbMp7c"],
      ["Sports And Outdoors", "https://youtu.be/W-X0648o_M4?t=21"],
      ["Acosta Blades", "https://youtu.be/qjmouNg4IKI"],
      ["Rollerblade", "https://youtu.be/_udYTFzbR00?t=13"],
      ["Tiago", "https://youtu.be/dq2mg0TOvO4?t=19"],
      ["Ricardo Lino", "https://youtu.be/EnhrFrD_Fas?t=478"],
      ["SkaMiDan", "https://youtu.be/inb3ypISGBA?t=184"],
      ["Stevemania", "https://youtu.be/4_heHgnTe5I?t=50"],
      ["LIVESTRONG.COM", "https://youtu.be/RMIRnNr-PeQ?t=119"]
    ]
  },

  "Backward crossovers": {
    "description": "Backward crossovers will be the main way to turn backwards, so learning this trick as soon as possible is highly recommended after learning how to skate backwards. Backward crossovers are almost exactly the same as forward crossovers, just that you are moving backwards. The main idea behind the trick is a controlled fall while stepping one leg over the other. Before attempting the backward crossovers, make sure you are comfortable with the backward scissors position and balancing on one leg while moving backward. You should be comfortable with your legs being crossed while moving backwards as well. To do a backward crossover, lift your outer foot and place it over your inner foot while lifting your inner foot once you have placed your outer foot down. Then, keep repeating the motion as your outer foot and inner foot are always alternating. When doing that, be sure to do the backward crossovers in slow motion, like holding the position after you have lifted your foot for two seconds, so that you will have absolute control over your legs while doing the trick, which will allow you to have silky smooth backward crossovers. Once you have mastered the backward crossovers, you can try sprinting backward crossovers. To do this, you have to do a little jump after every step and you should reduce the distance that you cross your legs over to increase the frequency of your crossovers. You should also learn the backward crossovers on both sides so you can turn backwards in both directions.",
    "videos": [
      ["Skatefresh Asha", "https://youtu.be/F2MmgV0AN7s"],
      ["Bill Stoppard", "https://youtu.be/uAJVh0OwtQg"],
      ["Skatefresh Asha", "https://youtu.be/ggL9PvOLHyY"],
      ["Brandon Drummond", "https://youtu.be/VxU-qwqJk58?t=244"],
      ["Rollerblade", "https://youtu.be/_udYTFzbR00?t=50"]
    ]
  }
}
