{
  "similarities": [
    "All of them have a hard plastic shell.",
    "All of them have a removable liner.",
    "All of them feature a 165mm mounting system.",
    "All of them have a frame made of extruded aluminium.",
    "All of them have parts that are fully replaceable.",
    "All of them allow you to attach a brake.",
    "All of them have slide pads.",
    "All of them have insoles."
  ],

  "differences": {

    "FRX (Base model)": [
      "It costs $265.",
      "It has a velcro power strap.",
      "It has a plastic top buckle.",
      "It comes with the FR X2R rockerable frames.",
      "It only has a single mounting hole at both mounting points.",
      "It has Street King wheels, which are the base-level wheels from FR.",
      "It has Twincam MW7 bearings."
    ],

    "FRW (Women's version of the FRX)": [
      "It is almost identical to the FRX.",
      "It costs $248, which makes it the cheapest and most affordable option.",
      "The liner is slightly narrower than the one on the FRX.",
      "There's a V-cut at the back of the liner to better accommodate a women's calves.",
      "It has a thinner velcro power strap than the one on the FRX.",
      "It comes with a brake preinstalled."
    ],

    "FR3 (1 tier above the FRX)": [
      "It costs $315.",
      "It has metal plates at both mounting points at the bottom of the skate, each having 7 mounting holes, which is unlike the single mounting hole on the FRX.",
      "The metal plates result in a greater energy transfer between your legs and the frame while also making the base of the skate stronger and more solid. They also provide more configuration options for mounting the frame onto the skate.",
      "It uses thicker bolts to mount the metal plates to the skate, which requires a tool that is slightly different from the one that comes with the skate, but you do get a stronger and more robust attachment.",
      "Instead of a velcro power strap, it has a plastic power strap with a metal ratcheting buckle."
    ],

    "FR2 (2 tiers above the FRX)": [
      "It costs $375.",
      "It has a plastic power strap that is wider and thicker than the one on the FR3. It also comes with a metal ratcheting buckle which has an FR logo on it and is bigger compared to the one on the FR3.",
      "It comes with a button cuff which makes it trivial to adjust the cuff's position.",
      "Like the FR3, it also has metal plates at both mounting points at the bottom of the skate.",
      "Unlike all of the previous models, the FR2 comes with the FR R2-R rockerable frames, which are the upgraded version of the FR X2R rockerable frames which are stronger and more rigid and hence perform better.",
      "It has Downtown wheels instead of Street King wheels, which are middle-level FR wheels.",
      "The 3x110mm version of the FR2 also has a longer, 246mm frame instead of the 231mm frame of the previous models. The longer frame is great for more stability and is better suited for longer rides."
    ],

    "FR1 (Top-of-the-line model, 3 tiers above the FRX)": [
      "It costs $455.",
      "It has the same plastic power strap that comes with a metal ratcheting buckle as the FR2. The buckle also has an FR logo on it.",
      "It also comes with the same button cuff that is on the FR2.",
      "It comes with FR 4D Flat Frames, which are stronger and sturdier than the frames on the FR2, but you lose the ability to rocker your skates.",
      "It comes with the best FR wheels, the Street Invader II wheels.",
      "It has a metal top buckle, which is an upgrade from the plastic top buckle on all of the other models.",
      "It has a shock absorber pad attached to the heel of the liner.",
      "It comes with a premium insole which is more comfortable.",
      "It comes with Twincam MW9 bearings, which are FR's top-level urban bearings, instead of the MW7 bearings that come with all of the other models. The MW9 bearings are built to withstand crazy amounts of force, which makes them more durable.",
      "It also comes with metal plates at both mounting points like the FR2 and the FR3.",
      "The 3x110mm version of the FR1 also comes with FR urban speed wheels, which are the best FR speed wheels.",
      "The 3x110mm version of the FR1 also comes with a shorter, 230mm frame."
    ]
  },

  "references": [
    "https://youtu.be/xv_8AwSKoww",
    "https://www.inlinex.com.sg/blogs/news/difference-between-fr1-fr2-fr3-and-frx",
    "https://youtu.be/je4NZ6YjEjY",
    "https://www.slickwillies.co.uk/blogs/news/fr-freeskate-range",
    "https://bladeville.com/blog/fr-skates-new-fr-line-models-for-2023-what-is-the-difference",
    "https://bladeville.com/blog/fr-skates-collection-2021"
  ]
}