{
  "Parallel 8 Wheels Slide": {
    "description": "The parallel slide is probably the most difficult of the 'common' slides. It looks deceptively easy, and most tutorials, even the tutorial videos listed below, make it look much easier than it actually is. First, before attempting to learn parallel slide, it is highly recommended that you swap your wheels for slide wheels, which are wheels with a hardness rating of 88A and above. Slide wheels that are highly recommended by most sliders are the 九轮至尊刹车轮, or God Wheels, which slide extremely well even when they're new and do not require any break-in time to get them to slide. You can probably only find these on TaoBao, a Chinese shopping site, so you'll have to understand Chinese or have someone who does understand Chinese to help you order them. You should order the white or black wheels as the other colours don't slide as well. The black wheels wear down slower than the white ones, so you should get those. Using normal urban or slalom wheels would work as well, but they will make sliding more difficult, making it easier to develop bad habits when practising parallel slides, which would greatly slow your progress.\n\nNext, you should find a flat and relatively smooth (but not too smooth or slippery) area to practice your parallel slide. A basketball or tennis court will work great for this. Keep using this area to practice your parallel slide until you are confident before moving to another surface as changing surfaces would require you to readjust a lot of things, which is terrible for feedback when you are learning the slide.\n\nLastly, be prepared for lots of conflicting advice and opinions, as the parallel slide is very personal and differs from person to person. Even this guide here may not help you, as it is just one person's experience learning parallel slides. Also, you should expect to fall a lot, since this is a slide that has no supporting leg to save you if you screw up.\n\nOn to the actual slide, you should start with the end position in mind. The end position of a parallel slide is to have your feet perpendicular to the direction you are moving in, and parallel to each other. Your body should form a C shape facing the front, with your head (and optionally arms) forming the top part of the C. Your hips form the middle part of the C, and your knees are bent towards the back (towards your hips) so that your legs can form the bottom part of the C. Your hips should also be facing to the side, instead of the front, as your legs have to be parallel. Your skates should be slightly angled into the ground like you are trying to cut the ground with your skates as a knife. Your weight should be distributed evenly, or 50 - 50, on both legs, as the parallel slide is an equal-weight slide. To determine whether your weight is distributed evenly among both legs, hold the end position while rolling forward; both legs should not move much. If one of your legs is very uncontrollable or is moving around quite a lot, that means there is insufficient weight on that leg, and you need to shift your weight from the other leg to that leg. Also, you should feel like you are sitting on a chair with your legs and knees bent to the side when in the position. Your legs should feel relaxed and not tense since you are sitting down. The position should therefore feel stable and not feel like you will fall. If you feel unstable, adjust your position until it feels stable. You want to practice simply holding this end position when you are stationary first to get comfortable with the position. You will have to hold this position after entering the slide to keep the slide going, so it is best to be as comfortable as possible with the position.\n\nOnce you are quite comfortable with the end position, put your lower body (everything below your hips) into the end position. Let's call this the preparation position. The mouth of the C shape should be on your right when you are twisting your hips left, and left when you are twisting your hips right. Another way to remember which direction to form the C shape is to put your hips on the same side of your body as the side you want to twist your hips. So hips on the left side for a left twist, and hips on the right side for a right twist. Your leg on the opposite side of the side you are twisting your hips to, i.e., the right leg for a left hip twist and the left leg for a right hip twist, should be placed slightly in front of your other leg, roughly one wheel in front. This front leg should not be too far in front of your other leg as it'll cause you to be unbalanced when preparing to enter the parallel slide and make it far more difficult to twist your hips to slide. Putting the front leg too far in front of your other leg makes it very easy to carve into the slide, which is what you absolutely do not want. In this position, you should also feel like you are sitting in a chair with your legs and knees bent to the side. Your legs should feel relaxed and not tense since you are sitting down. It should feel stable, and not like you are going to fall.\n\nOnce you are in the preparation position, put slightly more weight on the front leg and slightly decrease the angle of that skate to the ground. This makes it easier for your front skate to slide, as it usually gets stuck and ends the slide prematurely. Refrain from putting too much weight on the front leg as it will also cause the outer skate to get stuck. Decreasing the angle of the front skate by too much is also bad, as it will cause the front skate to slide far further than the back skate, putting you into a position more akin to a magic slide rather than a parallel slide, which is not ideal. After that, twist your hips in the desired direction, release the additional weight and increase the front skate's angle to the ground. When twisting your hips, try not to move your upper body, which means you should keep the exact same height before and after the hip twist. That said, if you need to move your hands to help you twist your hips, you can do so. Your legs should be completely relaxed when twisting your hips. You don't want to use your muscles to tense up your leg as it will only make the slide more difficult by increasing friction to the ground. You want to have as little friction with the ground as possible, so you should strive to have only your body weight pushing on the ground and not any more weight than that. Also, by tensing up your leg muscles, you will tend to use your leg muscles to emulate the twisting motion, which is bad as it has a high chance of twisting and injuring your knee, while also causing you to carve into the slide. Carving into the slide is something you want to avoid at all costs, as your skates won't be parallel when you do so. It will always be one leg moving after the other, and anything you do to keep them together and moving in sync will be futile. Only a proper hip twist with your legs fully relaxed can do that, as your legs will follow the movement of your hips and move as a block, instead of moving one after the other. Your toes should be the pivot point for your legs when your hips are twisting, so your heels move instead of your toes. If your hip twist turns your skates about their centres, then you need to place more weight on your toes to make your toes stay in place and get your heels to move. If your heels fly up above the ground due to the friction, you are halfway there and the motion is correct. You most likely need to keep practising the hip twist while keeping your heels on the ground, but do not tense up your leg to do it. Shifting your weight towards your heels will do the trick but ensure that the toe is still the pivot point for the hip twist by keeping some weight on the toes. It is best to do this practice while stationary, and you can try the motion on foot using socks or slippery shoes, like canvas shoes. Sometimes, just reducing your skates' angle to the ground by bending your knees more and sitting lower when you are in the end position preparing for the hip twist would fix the issue, if your leg muscles are already there. Ensuring your legs are relaxed usually helps, as there is less friction with the ground compared to tense legs.\n\nOnce you can do the above, keep practising until you are comfortable and confident doing the slide. Start at a slow speed, making sure that you can enter the slide. You will likely not slide much but will come to a stop. If you find yourself still moving after the slide, that means your slide wasn't successful, and you carved into the slide. Focus on twisting your hips and not using your leg muscles to emulate the twisting motion. Try exhaling to relax your leg muscles before twisting your hips into the slide. Once you can pull the slide off consistently at low speeds, increase the speed bit by bit. It should be easier to slide at higher speeds, which means increasing your skates' angle to the ground to not slide out and wear down your slide pads. You may also need to decrease the force you use when twisting your hips, otherwise, you might over-twist and end up in the wrong direction (usually to the side instead of going straight). Try to keep practising on the same surface, as it will give consistent feedback for adjusting your skates' angle to the ground and how forcefully you have to twist your hips. Only change surfaces once you have mastered the previous one and practice the slide on a new surface before trying to do it at high speeds, or it will end horribly. If you would like to use this slide as an emergency stop for urban skating, make sure you have at least practised the slide on slippery surfaces, relatively smooth surfaces, and rough surfaces with a lot of friction. It is generally not recommended to try this slide on rocky or uneven surfaces, but if you have sufficient practice on such surfaces, then more power to you.\n\nHere are some important points to harp upon. The first and most important point is that you absolutely cannot carve into the slide. By carving into the slide, you are doing Bill Stoppard's power stop instead of a parallel slide and will find it impossible to slide at low speeds, even with slide wheels equipped. Without slide wheels, you will find it difficult to slide even at relatively high speeds as you don't cut into the slide. Instead, you should twist your hips and let your body do the rest. This hip twist is essential in ensuring your legs move together, not one after the other, which is often the case when carving into a parallel slide. You will find a lot of tutorials teaching you to carve into a parallel slide, which is completely wrong and will injure your knees, as you will end up using your leg muscles to twist your legs into the parallel position, inevitably twisting your knees. You should not experience knee pain when practising parallel slides. If you do, stop practising the slide immediately and give your knees a break. Do something else instead for the time being and let your knees heal. When you try parallel slide again, ensure that your hips are twisting, instead of your legs. Keeping your legs relaxed and twisting your hips fixes this problem, but it is easier said than done.\n\nThe second point is to ensure that you feel like you are sitting down in a chair and your legs are relaxed when preparing to twist your hips into the slide. Feeling stable in this preparation position is essential for a successful parallel slide, as it is the end position of the slide. Any instability in this position will cause the slide to fail, sometimes catastrophically, and sometimes recoverably. If you feel unstable in this preparation position, adjust until you feel stable and comfortable or abort. You might get injured if you continue the slide when you feel unstable in this preparation position. Usually, tensing up your legs will likely lead to more instability, so keep your legs as relaxed as possible and your knees bent. Tensing up your leg also usually causes you to straighten your knees instead of keeping them bent, increasing the height after entering the slide, which will throw you backwards and is far from ideal as it may cause you to fall backwards. The added friction from tense legs also makes the slide more difficult to enter, so keeping your legs relaxed and letting your hips do the work is critical, but it is much easier said than done.\n\nThe third point is to keep your height the same before and after the slide. This ensures no extra force from the ground pushes you forward or backwards during the slide. Most people will tend to increase their height by straightening their knees, which causes them to be pushed backwards. This kills the slide due to the increased friction and may result in a backward fall. There may be a few times when you decrease your height instead, which causes you to be thrown forward, and you may fall forward. It is less dangerous than increasing your height during the slide, but still not ideal due to how unstable the slide feels. The easiest way to ensure your height remains the same before and after the slide is to keep your entire upper body locked, and your knees bent throughout the slide.\n\nThe fourth point is to place a small amount of additional weight on the front skate and slightly decrease its angle to the ground in the preparation position to slide more smoothly. This is essential to hitting the parallel slide consistently, as without this, your front skate tends to get stuck and end the slide prematurely, or just result in a turn, both of which are far from ideal. However, great care must be taken to ensure the additional weight and decrease in angle are small, as too much weight or too small an angle will backfire and cause the slide to fail. Too much weight will cause your front skate to get stuck, which ends your slide prematurely and may cause you to turn. Too small an angle to the ground will cause your front leg to slide away, turning the slide into an improper magic slide that may cause you to split. Make sure you release the additional weight and increase the angle to the ground after you have twisted your hips, as it ensures your weight is back to being equally distributed between both skates and your skate's angle to the ground will be just right.\n\nThe fifth and final point is that your skates must pivot about your toes and not around any other point, and your heels must always be on the ground when twisting your hips. If you are drawing circles with your skates, you are pivoting them about the centre and need to push more weight to your toes to keep them anchored in place. If your heels are flying off the ground, you need to shift more weight to your heels to keep them on the ground and do stationary practice for the hip twisting motion, until your heels are sliding against the ground with your toes anchored. If your toes are not the pivot point, you will end up just spinning in a circle instead of sliding, and if your heels are off the ground, you will end up falling forward as your heels will swing much further forward compared to your toes as they are off the ground, causing you to fly forward.\n\nAs an aside, if you are constantly hitting or grinding your slide pads when you do a parallel slide, check if the frame on your skates has shifted. A shifted frame usually results in the slide pad of the back skate touching and grinding off the ground even when the angle is fine.\n\nThere's a lot of information above, so here's a quick summary of the important points to note. First, ensure you are comfortable and stable in the preparation position, which is also the end position, before entering the slide. You should feel like you are sitting in a chair with your knees bent to the side in this position. Your weight should also be evenly distributed on both of your legs, except when you are in the preparation position, where your front leg has slightly more weight and a larger angle to the ground than the other leg. Second, you must only twist your hips while keeping your legs relaxed to enter the slide. Carving into the slide will not work. Third, your upper body should ideally not move when twisting your hips, so your height must stay the same before and after you twist your hips to enter the slide. A common mistake is to increase your height after entering the slide, which throws you backwards which might cause you to fall. Fourth, place a bit of additional weight and slightly decrease the angle of the front skate to the ground before twisting your hips, making sure to undo it after you are in the slide. Fifth, when twisting your hips, your toes must be anchored to the ground to serve as a pivot point, while your heels must also stay on the ground and be the ones that slide against the ground. Failure to do so usually results in pretty bad falls. Lastly, make your life easier by switching your wheels to slide wheels, like 九轮至尊刹车轮 or God wheels. Practice on the same flat and relatively smooth (not too smooth or slippery) surface, like a basketball or tennis court, to get more consistent feedback until you can consistently perform the slide instead of constantly switching surfaces, which will slow down your progress due to the ever-changing feedback and hence adjustments.",
    "videos": [
      ["Airgy (turn on captions)", "https://youtu.be/GH17fCAm6BY"],
      ["RollerLine (turn on captions)", "https://youtu.be/yxhD7ZwPS7w?t=17"],
      ["RollerLine (turn on captions)", "https://youtu.be/N-liq7jWDY0?t=18"],
      ["Flow Skate", "https://youtu.be/KhIjNeXbYzA?t=36"],
      ["Flow Skate", "https://youtu.be/VR2co2JmXqM"],
      ["Darvin Mckinney", "https://youtu.be/a5Y07tHZ0Oo"],
      ["I Love Rolki (turn on captions)", "https://youtu.be/4EbONn3XMxI"],
      ["Danny Aldridge", "https://youtu.be/kWruOe0kwkg?t=213"],
      ["Ricardo Lino", "https://youtu.be/LdluaIVRSec?t=103"],
      ["Ricardo Lino", "https://youtu.be/UAblYvh-TNY?t=115"],
      ["Tiago", "https://youtu.be/HKvh70_CX5o?t=35"],
      ["Rollerbalding", "https://youtu.be/AOh_NYuLvzc"],
      ["Skatefresh Asha", "https://youtu.be/pUk0o1gjgO4"],
      ["Line Makers", "https://youtu.be/1e07ZzdgtOA?t=52"],
      ["Natan Lakonishok", "https://youtu.be/MCDmNmLBe2s"],
      ["Natan Lakonishok", "https://youtu.be/kKb4zaOzSXs"],
      ["Natan Lakonishok", "https://youtu.be/Ke7wWachAg0"],
      ["Natan Lakonishok", "https://youtu.be/G77g2Y6iTyo"],
      ["How To Inline Skate", "https://youtu.be/fhaO3e1mn9I"],
      ["In-Line Skating Instructions", "https://youtu.be/osjccBerlUM?t=21"],
      ["Slide Academy", "https://youtu.be/AgX98iK6fOI?t=7"],
      ["Ask Roller (turn on captions)", "https://youtu.be/-_zzq51wYJ0?t=2"],
      ["Pride Crew", "https://youtu.be/noMkRMPX5mI?t=9"],
      ["InMove Skates", "https://youtu.be/h_pv1McvUBs?t=20"],
      ["danielel73", "https://youtu.be/xTiW14M4obc"],
      ["Rollerblade", "https://youtu.be/RyG_4YUCbFk?t=13"],
      ["Danny Aldridge", "https://youtu.be/LX1NPQDwXuw?t=136"],
      ["Darvin Mckinney", "https://youtu.be/vDNAqtswUkk"],
      ["ReKiL.ru Team", "https://youtu.be/RY0zc5ReuBk"],
      ["EZ Action", "https://youtu.be/BELKbdGmO9Y?t=104"],
      ["Team Some What There", "https://youtu.be/wGOOrZ4Z8zI?t=7"]
    ]
  },

  "Da Slide": {
    "description": "",
    "videos": [
      ["Zhi Zhong", "https://youtu.be/tftTeSBLWPI"]
    ]
  }
}
