{
  "Luminous Wheels": {
    "link": "https://luminouswheels.com/",
    "description": "Luminous Wheels is yet another company owned by Sebastien Laffargue and as the name suggests, they specialise in producing high-quality light-up wheels. While the wheels are of very high quality, they are quite expensive, costing about $15 per wheel. You do get what you pay for though, and it's the go-to recommendation for LED wheels in the inline skating community."
  },

  "Undercover": {
    "link": "https://powerslide.com/pages/uc-homepage",
    "description": "Undercover is a sub-brand of Powerslide that specialises in wheels. They make high-quality wheels for urban and aggressive skating which contain their Ultra High Rebound (UHR) compound that apparently provides superior cushioning and increased responsiveness. They are also made in the USA. Their wheels aren't the cheapest, with the price of a single wheel ranging from $9 - $30. However, their wheels are one of the most trusted and well-known by the inline skating community, with them being the reference when it comes to wheel comparisons. If you want to upgrade your wheels, looking through the Undercover catalogue would be a good place to start."
  },

  "Mushroom Blading": {
    "link": "https://www.mushroomblading.com/",
    "description": "Mushroom Blading is a company run by 4 skaters, namely Joey McGarry, Todd Mcinerney, Joe Garry and Rod Kinney. They specialise in high-quality wheels and have wheels for all styles of skating. Their wheels are not the priciest but are still relatively expensive at about $10 per wheel. The wheels are high quality and are really good for the price. If you want an affordable yet high-quality wheel that performs wheel, you should look into getting Mushroom Blading wheels."
  },
  
  "Famus Wheels": {
    "link": "https://www.instagram.com/famuswheels/?hl=en",
    "description": "Famus Wheels is a French company that specialises in wheels for inline and roller skates. Their wheels are very different from most other wheels in that they have an aluminium core, which makes the wheels sturdier and feel more responsive. Their wheels are on the pricier side, with each wheel going for about $20 - $30. The additional cost likely comes from that metal core. However, having a metal core also comes with some drawbacks, like needing a bearing press to be able to change the bearings as the bearings are very tightly fitted and aluminium doesn't flex as much as plastic does. Overall, they are great wheels if you want wheels that feel more responsive and look cool (that metal core is sick)."
  },
  
  "Junk Wheels": {
    "link": "https://junkwheels.com/",
    "description": "Junk Wheels are, surprisingly, not junk. They are racing wheels made in the USA. Despite their name, Junk Wheels are actually very pricey and don't come cheap, with a single wheel coming in at about $30 to $50. The wheels being made in the USA could explain some of that cost, but it is still far more expensive than most other wheels out there. They claim to be the fastest wheels in the world and are designed to maximise speed. However, they don't get a lot of reviews or mentions, which isn't unusual considering that most skaters would just stick with the stock wheels that come with their skates, but that also makes it difficult to verify their claim of being the fastest wheels in the world. That said, they are generally good wheels, with most reviews about them being positive, but you can probably find cheaper alternatives elsewhere."
  }
}